[
  {
    "id": 1,
    "club": "Tech Innovators",
    "title": "Hackathon 2024",
    "overview": "A 48-hour coding marathon where students create tech solutions for local businesses.",
    "objectives": "Foster practical coding skills and connect students with potential employers.",
    "audience": "Computer science and engineering students.",
    "date": "2024-03-15 to 2024-03-17",
    "venue": "Engineering Building, Room 101",
    "attendance": "Expected 100 participants",
    "collab_benefits": "Shared resources, increased reach, split costs, enhanced networking opportunities.",
    "tasks_remaining": "Need clubs for marketing, logistics, and securing sponsors.",
    "budget": "Estimated total cost: $5000. Each club contributes $1250.",
    "type": ["tech", "workshop"],
    "similar_events": "Previous Hackathon had 80 attendees with positive feedback on learning outcomes."
  },
  {
    "id": 2,
    "club": "Eco Warriors",
    "title": "Green Campus Day",
    "overview": "An event promoting sustainability and eco-friendly practices on campus.",
    "objectives": "Increase awareness about environmental issues and engage students in sustainable practices.",
    "audience": "All university students and faculty interested in sustainability.",
    "date": "2024-04-22",
    "venue": "University Commons",
    "attendance": "Expected 300 attendees",
    "collab_benefits": "Joint marketing efforts, shared logistical support, and enhanced community impact.",
    "tasks_remaining": "Looking for clubs to handle workshops, exhibitions, and guest speakers.",
    "budget": "Budget is $3000, hoping for each club to contribute around $750.",
    "type": ["environmental", "community event"],
    "similar_events": "Last year's Green Campus Day attracted 250 people with very engaging activities and great feedback."
  },
  {
    "id": 3,
    "club": "Art Collective",
    "title": "Campus Art Fair",
    "overview": "A showcase of student artwork, including paintings, sculptures, and installations.",
    "objectives": "Promote student artists and foster an appreciation of art within the university community.",
    "audience": "Students, faculty, and external visitors interested in art.",
    "date": "2024-05-10 to 2024-05-12",
    "venue": "Art Department, Open Grounds",
    "attendance": "Expected 200 visitors daily",
    "collab_benefits": "Exposure for artists, shared organizational duties, and broader audience reach.",
    "tasks_remaining": "Need help with setup, marketing, and managing sales transactions.",
    "budget": "Total expected budget is $2000, split equally among collaborating clubs.",
    "type": ["exhibition", "art"],
    "similar_events": "Previous art fairs have been highly successful, with sales contributing to funding student art projects."
  },
  {
    "id": 4,
    "club": "Debate Team",
    "title": "Annual Inter-College Debate Championship",
    "overview": "A competition among college debate teams to foster critical thinking and public speaking skills.",
    "objectives": "Encourage a spirit of healthy competition and showcase debating talents.",
    "audience": "Debate enthusiasts, students from various departments, faculty.",
    "date": "2024-11-01 to 2024-11-02",
    "venue": "Main Auditorium",
    "attendance": "Expected 200 attendees",
    "collab_benefits": "Shared resources, increased reach across colleges, joint media coverage.",
    "tasks_remaining": "Need help with event logistics, participant coordination, and publicity.",
    "budget": "Estimated budget is $3500, shared among participant colleges.",
    "type": ["debate", "competition"],
    "similar_events": "Last year's event attracted over 150 participants and was featured in the college newsletter."
  },
  {
    "id": 5,
    "club": "Entrepreneurs Network",
    "title": "Startup Weekend",
    "overview": "An event where students can form teams, pitch ideas, and start their own business over a weekend.",
    "objectives": "Inspire entrepreneurship and provide practical experience in starting a business.",
    "audience": "Aspiring entrepreneurs, business students, local investors.",
    "date": "2024-10-15 to 2024-10-17",
    "venue": "Business School Hub",
    "attendance": "Expected 120 participants",
    "collab_benefits": "Opportunity for networking, resource sharing, and gaining insights from experienced entrepreneurs.",
    "tasks_remaining": "Seeking clubs to manage workshops, mentor matching, and investor pitches.",
    "budget": "Total budget of $4000, with contributions expected from sponsors and participant fees.",
    "type": ["workshop"],
    "similar_events": "Previous editions have successfully launched 10+ student-led startups."
  },
  {
    "id": 6,
    "club": "Cinema Club",
    "title": "International Film Festival",
    "overview": "A celebration of international cinema, featuring films from different cultures around the world.",
    "objectives": "Promote cultural diversity and appreciation through cinema.",
    "audience": "Film students, faculty, cinephiles, general public.",
    "date": "2024-09-20 to 2024-09-25",
    "venue": "Campus Theater",
    "attendance": "Expected 300 attendees daily",
    "collab_benefits": "Cultural exchange, enhanced visibility for foreign language departments, potential collaborations with local film societies.",
    "tasks_remaining": "Looking for clubs to handle film selections, guest speakers, and promotions.",
    "budget": "Expected budget is $5000, seeking funding through ticket sales and sponsorships.",
    "type": ["festival", "film"],
    "similar_events": "Last year's festival drew large crowds and received positive media coverage."
  },
  {
    "id": 7,
    "club": "Music Society",
    "title": "Jazz Under the Stars",
    "overview": "An outdoor jazz concert featuring student musicians and well-known guest artists.",
    "objectives": "Showcase musical talent and provide a relaxing entertainment option on campus.",
    "audience": "Students, staff, local community members who enjoy jazz.",
    "date": "2024-08-05",
    "venue": "University Quadrangle",
    "attendance": "Expected 400 attendees",
    "collab_benefits": "Shared stage setup and promotional efforts, enhanced audience reach.",
    "tasks_remaining": "Need assistance with stage management, artist liaison, and event marketing.",
    "budget": "Estimated budget of $3000, partly covered by ticket sales.",
    "type": ["concert"],
    "similar_events": "Previous concerts have been a major hit, drawing large crowds and fostering a love for jazz."
  },
  {
    "id": 8,
    "club": "Literary Guild",
    "title": "Poetry Slam Night",
    "overview": "An evening where students and local poets can perform and compete with original poetry.",
    "objectives": "Foster a love for poetry and provide a platform for creative expression.",
    "audience": "Poetry enthusiasts, literature students, general audience interested in literary arts.",
    "date": "2024-07-22",
    "venue": "Campus Café",
    "attendance": "Expected 150 attendees",
    "collab_benefits": "Exposure for upcoming poets, community building around the arts.",
    "tasks_remaining": "Looking for support in organizing, judging, and publicizing the event.",
    "budget": "Planned budget is $1000, covered by entry fees and small sponsorships.",
    "type": ["performance"],
    "similar_events": "Last year's poetry night was highly acclaimed, with engaging performances and a large audience."
  },
  {
    "id": 13,
    "club": "Adventure Club",
    "title": "Outdoor Adventure Weekend",
    "overview": "A weekend retreat featuring hiking, kayaking, and camping activities.",
    "objectives": "Foster a love for the outdoors and teamwork among students.",
    "audience": "Adventure enthusiasts and anyone looking to explore the outdoors.",
    "date": "2024-06-11 to 2024-06-13",
    "venue": "Lakeview National Park",
    "attendance": "Expected 150 participants",
    "collab_benefits": "Joint organization with local adventure groups, shared equipment and safety training.",
    "tasks_remaining": "Organizing transport, securing camp sites, and coordinating safety briefings.",
    "budget": "Expected budget is $4500, including park fees and equipment rental.",
    "type": ["retreat", "wellness"],
    "similar_events": "Last year's event saw high participation and positive feedback from attendees."
  },
  {
    "id": 14,
    "club": "Film Society",
    "title": "Documentary Screening Series",
    "overview": "Monthly screenings of documentaries focusing on social issues and innovations.",
    "objectives": "Educate and inspire discussion on global challenges and achievements.",
    "audience": "Students interested in filmmaking, social issues, and activism.",
    "date": "Starts 2024-08-15, monthly event",
    "venue": "Campus Media Center",
    "attendance": "Expected 50 attendees per screening",
    "collab_benefits": "Educational enrichment, fostering a community of informed students, potential partnerships with local filmmakers.",
    "tasks_remaining": "Film selection, guest speaker invitations, and promotional activities.",
    "budget": "Monthly budget of $500 for rights acquisition and guest honorariums.",
    "type": ["screening", "film"],
    "similar_events": "Previous series were well-received, leading to active student engagements and panel discussions."
  },
  {
    "id": 15,
    "club": "Tech Club",
    "title": "Women in Tech Conference",
    "overview": "A conference to inspire and empower women in technology fields with workshops, keynote speakers, and networking opportunities.",
    "objectives": "Support diversity in tech and provide a platform for female tech leaders and students.",
    "audience": "Students, especially women in computer science and engineering, tech professionals.",
    "date": "2024-03-08",
    "venue": "Technology Hall",
    "attendance": "Expected 300 participants",
    "collab_benefits": "Strengthen community ties, provide mentorship opportunities, increase awareness of diversity issues in tech.",
    "tasks_remaining": "Securing sponsors, finalizing speakers, and marketing the event.",
    "budget": "Estimated budget is $10000, seeking corporate sponsorships and university support.",
    "type": ["tech", "conference"],
    "similar_events": "Last year's event successfully attracted notable speakers and several tech company sponsors."
  },
  {
    "id": 16,
    "club": "History Club",
    "title": "Historical Reenactment Day",
    "overview": "A day-long event featuring reenactments from different historical periods and cultures.",
    "objectives": "Educate and entertain through interactive historical presentations.",
    "audience": "History buffs, students from all majors, local schools.",
    "date": "2024-10-25",
    "venue": "Old Campus Quad",
    "attendance": "Expected 200 attendees",
    "collab_benefits": "Engaging learning experience, enhanced visibility for history and theater departments.",
    "tasks_remaining": "Costume preparation, script development, participant training.",
    "budget": "Total budget of $3000, partially funded by the history department.",
    "type": ["educational"],
    "similar_events": "Past reenactments have been crowd-pleasers with strong educational value."
  },
  {
    "id": 17,
    "club": "Economics Club",
    "title": "Economic Policy Debate",
    "overview": "A debate on current economic policies featuring student debaters and guest economists.",
    "objectives": "Stimulate critical thinking and discussion on economic issues.",
    "audience": "Economics students, faculty, anyone interested in economic policy.",
    "date": "2024-09-17",
    "venue": "Business School Lecture Hall",
    "attendance": "Expected 100 attendees",
    "collab_benefits": "Opportunity for students to engage with experts, enhance understanding of real-world economic issues.",
    "tasks_remaining": "Arranging guest speakers, setting up debate format, and promotional efforts.",
    "budget": "Planned budget of $2500, looking for departmental and external funding.",
    "type": ["debate"],
    "similar_events": "Previous debates have facilitated lively discussions and high student involvement."
  }
]
